/** last changed: 2025.1.1 */

/**
 * https://www.ifreesite.com/phonetic/phonetic.htm
 */

Shuang.resource.bopomofo = {
  '': {
    a: 'ㄚ', ai: 'ㄞ', an: 'ㄢ', ang: 'ㄤ', ao: 'ㄠ',
    e: 'ㄜ', ei: 'ㄟ', en: 'ㄣ',
    eng: 'ㄥ',
    er: 'ㄦ',
    o: 'ㄛ', ou: 'ㄡ'
  },
  b: {
    a: 'ㄅㄚ', ai: 'ㄅㄞ', an: 'ㄅㄢ', ang: 'ㄅㄤ', ao: 'ㄅㄠ',
    ei: 'ㄅㄟ', en: 'ㄅㄣ', eng: 'ㄅㄥ',
    i: 'ㄅ一', ian: 'ㄅ一ㄢ', iao: 'ㄅ一ㄠ', ie: 'ㄅ一ㄝ', in: 'ㄅ一ㄣ', ing: 'ㄅ一ㄥ',
    o: 'ㄅㄛ',
    u: 'ㄅㄨ'
  },
  c: {
    a: 'ㄘㄚ', ai: 'ㄘㄞ', an: 'ㄘㄢ', ang: 'ㄘㄤ', ao: 'ㄘㄠ',
    e: 'ㄘㄜ', en: 'ㄘㄣ', eng: 'ㄘㄥ',
    i: 'ㄘ',
    ong: 'ㄘㄨㄥ', ou: 'ㄘㄡ',
    u: 'ㄘㄨ', uan: 'ㄘㄨㄢ', ui: 'ㄘㄨㄟ', un: 'ㄘㄨㄣ', uo: 'ㄘㄨㄛ'
  },
  d: {
    a: 'ㄉㄚ', ai: 'ㄉㄞ', an: 'ㄉㄢ', ang: 'ㄉㄤ', ao: 'ㄉㄠ',
    e: 'ㄉㄜ', ei: 'ㄉㄟ', en: 'ㄉㄣ', eng: 'ㄉㄥ',
    i: 'ㄉ一', ia: 'ㄉ一ㄚ', ian: 'ㄉ一ㄢ', iao: 'ㄉ一ㄠ', ie: 'ㄉ一ㄝ', ing: 'ㄉ一ㄥ', iu: 'ㄉ一ㄡ',
    ong: 'ㄉㄨㄥ', ou: 'ㄉㄡ',
    u: 'ㄉㄨ', uan: 'ㄉㄨㄢ', ui: 'ㄉㄨㄟ', un: 'ㄉㄨㄣ', uo: 'ㄉㄨㄛ'
  },
  f: {
    a: 'ㄈㄚ', an: 'ㄈㄢ', ang: 'ㄈㄤ',
    ei: 'ㄈㄟ', en: 'ㄈㄣ', eng: 'ㄈㄥ',
    o: 'ㄈㄛ', ou: 'ㄈㄡ',
    u: 'ㄈㄨ'
  },
  g: {
    a: 'ㄍㄚ', ai: 'ㄍㄞ', an: 'ㄍㄢ', ang: 'ㄍㄤ', ao: 'ㄍㄠ',
    e: 'ㄍㄜ', ei: 'ㄍㄟ', en: 'ㄍㄣ', eng: 'ㄍㄥ',
    ong: 'ㄍㄨㄥ', ou: 'ㄍㄡ',
    u: 'ㄍㄨ', ua: 'ㄍㄨㄚ', uai: 'ㄍㄨㄞ', uan: 'ㄍㄨㄢ', uang: 'ㄍㄨㄤ', ui: 'ㄍㄨㄟ', un: 'ㄍㄨㄣ', uo: 'ㄍㄨㄛ'
  },
  h: {
    a: 'ㄏㄚ', ai: 'ㄏㄞ', an: 'ㄏㄢ', ang: 'ㄏㄤ', ao: 'ㄏㄠ',
    e: 'ㄏㄜ', ei: 'ㄏㄟ', en: 'ㄏㄣ', eng: 'ㄏㄥ',
    ong: 'ㄏㄨㄥ', ou: 'ㄏㄡ',
    u: 'ㄏㄨ', ua: 'ㄏㄨㄚ', uai: 'ㄏㄨㄞ', uan: 'ㄏㄨㄢ', uang: 'ㄏㄨㄤ', ui: 'ㄏㄨㄟ', un: 'ㄏㄨㄣ', uo: 'ㄏㄨㄛ'
  },
  j: {
    i: 'ㄐ一', ia: 'ㄐ一ㄚ', ian: 'ㄐ一ㄢ', iang: 'ㄐ一ㄤ', iao: 'ㄐ一ㄠ', ie: 'ㄐ一ㄝ', in: 'ㄐ一ㄣ', ing: 'ㄐ一ㄥ', iong: 'ㄐㄩㄥ', iu: 'ㄐ一ㄡ',
    u: 'ㄐㄩ', uan: 'ㄐㄩㄢ', ue: 'ㄐㄩㄝ', un: 'ㄐㄩㄣ'
  },
  k: {
    a: 'ㄎㄚ', ai: 'ㄎㄞ', an: 'ㄎㄢ', ang: 'ㄎㄤ', ao: 'ㄎㄠ',
    e: 'ㄎㄜ', ei: 'ㄎㄟ', en: 'ㄎㄣ', eng: 'ㄎㄥ',
    ong: 'ㄎㄨㄥ', ou: 'ㄎㄡ',
    u: 'ㄎㄨ', ua: 'ㄎㄨㄚ', uai: 'ㄎㄨㄞ', uan: 'ㄎㄨㄢ', uang: 'ㄎㄨㄤ', ui: 'ㄎㄨㄟ', un: 'ㄎㄨㄣ', uo: 'ㄎㄨㄛ'
  },
  l: {
    a: 'ㄌㄚ', ai: 'ㄌㄞ', an: 'ㄌㄢ', ang: 'ㄌㄤ', ao: 'ㄌㄠ',
    e: 'ㄌㄜ', ei: 'ㄌㄟ', eng: 'ㄌㄥ',
    i: 'ㄌ一', ia: 'ㄌ一ㄚ', ian: 'ㄌ一ㄢ', iang: 'ㄌ一ㄤ', iao: 'ㄌ一ㄠ', ie: 'ㄌ一ㄝ', in: 'ㄌ一ㄣ', ing: 'ㄌ一ㄥ', iu: 'ㄌ一ㄡ',
    o: 'ㄌㄛ', ong: 'ㄌㄨㄥ', ou: 'ㄌㄡ',
    u: 'ㄌㄨ', uan: 'ㄌㄨㄢ', un: 'ㄌㄨㄣ', uo: 'ㄌㄨㄛ',
    v: 'ㄌㄩ', ve: 'ㄌㄩㄝ'
  },
  m: {
    a: 'ㄇㄚ', ai: 'ㄇㄞ', an: 'ㄇㄢ', ang: 'ㄇㄤ', ao: 'ㄇㄠ',
    e: 'ㄇㄜ', ei: 'ㄇㄟ', en: 'ㄇㄣ', eng: 'ㄇㄥ',
    i: 'ㄇ一', ian: 'ㄇ一ㄢ', iao: 'ㄇ一ㄠ', ie: 'ㄇ一ㄝ', in: 'ㄇ一ㄣ', ing: 'ㄇ一ㄥ', iu: 'ㄇ一ㄡ',
    o: 'ㄇㄛ', ou: 'ㄇㄡ',
    u: 'ㄇㄨ'
  },
  n: {
    a: 'ㄋㄚ', ai: 'ㄋㄞ', an: 'ㄋㄢ', ang: 'ㄋㄤ', ao: 'ㄋㄠ',
    e: 'ㄋㄜ', ei: 'ㄋㄟ', en: 'ㄋㄣ', eng: 'ㄋㄥ',
    i: 'ㄋ一', ian: 'ㄋ一ㄢ', iang: 'ㄋ一ㄤ', iao: 'ㄋ一ㄠ', ie: 'ㄋ一ㄝ', in: 'ㄋ一ㄣ', ing: 'ㄋ一ㄥ', iu: 'ㄋ一ㄡ',
    ong: 'ㄋㄨㄥ', ou: 'ㄋㄡ',
    u: 'ㄋㄨ', uan: 'ㄋㄨㄢ', uo: 'ㄋㄨㄛ',
    v: 'ㄋㄩ', ve: 'ㄋㄩㄝ'
  },
  p: {
    a: 'ㄆㄚ', ai: 'ㄆㄞ', an: 'ㄆㄢ', ang: 'ㄆㄤ', ao: 'ㄆㄠ',
    ei: 'ㄆㄟ', en: 'ㄆㄣ', eng: 'ㄆㄥ',
    i: 'ㄆ一', ian: 'ㄆ一ㄢ', iao: 'ㄆ一ㄠ', ie: 'ㄆ一ㄝ', in: 'ㄆ一ㄣ', ing: 'ㄆ一ㄥ',
    o: 'ㄆㄛ', ou: 'ㄆㄡ',
    u: 'ㄆㄨ'
  },
  q: {
    i: 'ㄑ一', ia: 'ㄑ一ㄚ', ian: 'ㄑ一ㄢ', iang: 'ㄑ一ㄤ', iao: 'ㄑ一ㄠ', ie: 'ㄑ一ㄝ', in: 'ㄑ一ㄣ', ing: 'ㄑ一ㄥ', iong: 'ㄑㄩㄥ', iu: 'ㄑ一ㄡ',
    u: 'ㄑㄩ', uan: 'ㄑㄩㄢ', ue: 'ㄑㄩㄝ', un: 'ㄑㄩㄣ'
  },
  r: {
    an: 'ㄖㄢ', ang: 'ㄖㄤ', ao: 'ㄖㄠ',
    e: 'ㄖㄜ', en: 'ㄖㄣ', eng: 'ㄖㄥ',
    i: 'ㄖ',
    ong: 'ㄖㄨㄥ', ou: 'ㄖㄡ',
    u: 'ㄖㄨ', ua: 'ㄖㄨㄚ', uan: 'ㄖㄨㄢ', ui: 'ㄖㄨㄟ', un: 'ㄖㄨㄣ', uo: 'ㄖㄨㄛ'
  },
  s: {
    a: 'ㄙㄚ', ai: 'ㄙㄞ', an: 'ㄙㄢ', ang: 'ㄙㄤ', ao: 'ㄙㄠ',
    e: 'ㄙㄜ', en: 'ㄙㄣ', eng: 'ㄙㄥ',
    i: 'ㄙ',
    ong: 'ㄙㄨㄥ', ou: 'ㄙㄡ',
    u: 'ㄙㄨ', uan: 'ㄙㄨㄢ', ui: 'ㄙㄨㄟ', un: 'ㄙㄨㄣ', uo: 'ㄙㄨㄛ'
  },
  t: {
    a: 'ㄊㄚ', ai: 'ㄊㄞ', an: 'ㄊㄢ', ang: 'ㄊㄤ', ao: 'ㄊㄠ',
    e: 'ㄊㄜ', eng: 'ㄊㄥ',
    i: 'ㄊ一', ian: 'ㄊ一ㄢ', iao: 'ㄊ一ㄠ', ie: 'ㄊ一ㄝ', ing: 'ㄊ一ㄥ',
    ong: 'ㄊㄨㄥ', ou: 'ㄊㄡ',
    u: 'ㄊㄨ', uan: 'ㄊㄨㄢ', ui: 'ㄊㄨㄟ', un: 'ㄊㄨㄣ', uo: 'ㄊㄨㄛ'
  },
  w: {
    a: 'ㄨㄚ', ai: 'ㄨㄞ', an: 'ㄨㄢ', ang: 'ㄨㄤ',
    ei: 'ㄨㄟ', en: 'ㄨㄣ', eng: 'ㄨㄥ',
    o: 'ㄨㄛ',
    u: 'ㄨ'
  },
  x: {
    i: 'ㄒ一', ia: 'ㄒ一ㄚ', ian: 'ㄒ一ㄢ', iang: 'ㄒ一ㄤ', iao: 'ㄒ一ㄠ', ie: 'ㄒ一ㄝ', in: 'ㄒ一ㄣ', ing: 'ㄒ一ㄥ', iong: 'ㄒㄩㄥ', iu: 'ㄒ一ㄡ',
    u: 'ㄒㄩ', uan: 'ㄒㄩㄢ', ue: 'ㄒㄩㄝ', un: 'ㄒㄩㄣ'
  },
  y: {
    a: '一ㄚ', an: '一ㄢ', ang: '一ㄤ', ao: '一ㄠ',
    e: '一ㄛ',
    i: '一', in: '一ㄣ', ing: '一ㄥ',
    o: '一ㄛ', ong: 'ㄩㄥ', ou: '一ㄡ',
    u: 'ㄩ', uan: 'ㄩㄢ', ue: 'ㄩㄝ', un: 'ㄩㄣ'
  },
  z: {
    a: 'ㄗㄚ', ai: 'ㄗㄞ', an: 'ㄗㄢ', ang: 'ㄗㄤ', ao: 'ㄗㄠ',
    e: 'ㄗㄜ', ei: 'ㄗㄟ', en: 'ㄗㄣ', eng: 'ㄗㄥ',
    i: 'ㄗ',
    ong: 'ㄗㄨㄥ', ou: 'ㄗㄡ',
    u: 'ㄗㄨ', uan: 'ㄗㄨㄢ', ui: 'ㄗㄨㄟ', un: 'ㄗㄨㄣ', uo: 'ㄗㄨㄛ'
  },
  ch: {
    a: 'ㄔㄚ', ai: 'ㄔㄞ', an: 'ㄔㄢ', ang: 'ㄔㄤ', ao: 'ㄔㄠ',
    e: 'ㄔㄜ', en: 'ㄔㄣ', eng: 'ㄔㄥ',
    i: 'ㄔ',
    ong: 'ㄔㄨㄥ', ou: 'ㄔㄡ',
    u: 'ㄔㄨ', ua: 'ㄔㄨㄚ', uai: 'ㄔㄨㄞ', uan: 'ㄔㄨㄢ', uang: 'ㄔㄨㄤ', ui: 'ㄔㄨㄟ', un: 'ㄔㄨㄣ', uo: 'ㄔㄨㄛ'
  },
  sh: {
    a: 'ㄕㄚ', ai: 'ㄕㄞ', an: 'ㄕㄢ', ang: 'ㄕㄤ', ao: 'ㄕㄠ',
    e: 'ㄕㄜ', ei: 'ㄕㄟ', en: 'ㄕㄣ', eng: 'ㄕㄥ',
    i: 'ㄕ',
    ou: 'ㄕㄡ',
    u: 'ㄕㄨ', ua: 'ㄕㄨㄚ', uai: 'ㄕㄨㄞ', uan: 'ㄕㄨㄢ', uang: 'ㄕㄨㄤ', ui: 'ㄕㄨㄟ', un: 'ㄕㄨㄣ', uo: 'ㄕㄨㄛ'
  },
  zh: {
    a: 'ㄓㄚ', ai: 'ㄓㄞ', an: 'ㄓㄢ', ang: 'ㄓㄤ', ao: 'ㄓㄠ',
    e: 'ㄓㄜ', ei: 'ㄓㄟ', en: 'ㄓㄣ', eng: 'ㄓㄥ',
    i: 'ㄓ',
    ong: 'ㄓㄨㄥ', ou: 'ㄓㄡ',
    u: 'ㄓㄨ', ua: 'ㄓㄨㄚ', uai: 'ㄓㄨㄞ', uan: 'ㄓㄨㄢ', uang: 'ㄓㄨㄤ', ui: 'ㄓㄨㄟ', un: 'ㄓㄨㄣ', uo: 'ㄓㄨㄛ'
  }
}